'''Сложность: О(n)
Алгоритм ищет последовательность открывающихся и закрывающихся скобок в скобках'''
def removeOuterParentheses(s):
    list_1 = ''  # Cтрока для записи открытых и закрытых скобок
    count = 1  # Счет последовательности
    i = 1  # Для прохода по строке
    while i < len(s):
        if s[i] == '(':  #Скобка открывающая, сount - незаконченная последовательность скобок
            count += 1
        elif s[i] == ')':  #Скобка акрывающая, сount - законченная последовательность скобок
            count -= 1
        if count == 0:  # Если последовательнось скобок закрывается переходим на новый блок
            i += 2
            count += 1
            continue  # Игнорируем то что написано ниже в цикли и начинаем проверку цикла заново.
        list_1 += s[i]  # Записывааем символы в строку
        i += 1  # Переход на следующий символ
    return list_1  # Возвращаем ответ

print(removeOuterParentheses('()(()())(())'))